export const Comment = {
  porder: "行业事业部等：以订单结束时间计算，状态为已托管且已完成，且未全额退款的订单</br>"
  + "知识产权：按首次付款时间统计的付款成交case数</br>"
  + "财税：按首次付款时间统计的付款成交订单数</br>"
  + "科技服务：按首次付款时间统计的合同数</br>"
  + "企业管家/区域线雇主总包：已打款的分包订单数</br>"
  + "其中，行业线总分包业务（已包含在上述行业事业部的数据中）采用总包环节的订单，与交易中心保持一致", 
  pgmv: "订单打款金额，包含行业事业部、知识产权、财税、科技服务、企业管家与区域线总分包业务分包订单的打款金额</br>" 
  + "其中，行业线总分包业务（已包含在上述行业事业部的数据中）采用总包环节订单对应的GMV，与交易中心保持一致",
  cusrate: "累计指标，计算至筛选时间中的结束时间</br>"
  + "雇主消费留存率 =上一年雇主存量用户在今年贡献的GSV / 上年年度雇主GSV；</br>"
  + " 服务商消费留存率 =上一年服务商存量用户在今年贡献的GSV / 上年年度服务商GSV；</br>"
  + "客户消费留存率 = （雇主分子+服务商分子）/上年年度 GSV</br>"
  + "上述定义中的今年指当前时间往前推365天，如17年11月28日-18年11月28日，去年指当前时间往前推的倒数第二个365天，如16年11月28日-17年11月28日",
  keyemploy: "今年（自然年）消费5000及以上的雇主数，计算当年1月1日至时间选择中的结束时间这期间的累计数据；",
  keyservice: "今年（自然年）消费5000及以上的服务商数，计算当年1月1日至时间选择中的结束时间这期间的累计数据",
  manaEmploy: "八戒企业管家已打款的分包订单对应的雇主数",
  manaOrder: "八戒企业管家已打款的分包订单数",
  manaGmv: "八戒企业管家已打款的分包订单的打款金额",
  manaProfit: "企业管家订单毛利=企业管家消耗金额-企业管家分包订单成本+企业管家分包订单佣金</br>"
  + "企业管家消耗金额=企业管家分包订单元宝数×500</br>"
  + "企业管家分包订单成本=企业管家分包订单验收后支付金额",
  noneEmploy: "除企业管家之外的成交雇主数，包括行业事业部、知产、财税、科技服务、区域线雇主总包业务（指成交的分包订单数）</br>" 
  + "其中，行业线总分包业务（已包含在上述行业事业部的数据中）采用总包环节订单对应的雇主，与交易中心保持一致",
  noneOrder: "除企业管家之外的成交订单数=企业服务订单数-企业管家消耗订单数，包括行业事业部、知产、财税、科技服务、区域线雇主总分包业务（指成交的分包订单数）</br>"
  + "其中，行业线总分包业务（已包含在上述行业事业部的数据中）采用总包环节的订单，与交易中心保持一致",
  noneGmv: "除企业管家之外的打款金额=GMV-企业管家消耗金额，包括行业事业部、知产、财税、科技服务、区域线总分包业务分包订单的打款金额</br>"
  + "其中，行业线总分包业务（已包含在上述行业事业部的数据中）采用总包环节订单对应的GMV，与交易中心保持一致",
  noneProfit: "除企业管家之外的毛利，由于知识产权、财税、科技服务毛利无法实时获取，故暂不包含</br>"
  + "区域线雇主总包毛利=雇主总包销售收款金额-雇主总包分包订单成本</br>"
  + "行业线雇主总分包毛利=总包成交金额-分包成交金额</br>"
  + "主站订单（雇主直接下单，非总分包业务订单）：佣金",
  newshop: "统计周期内，新开店的服务商数量，包括天蓬开店和猪八戒开店（开店指开店状态成功，按照开店成功日期统计）",
  shopIncome: "统计周期内的服务商收入（服务商收入来源包含服务商赏金、推广员分成、退税给服务商和退还快递费）",
  contri: "服务商贡献的平台收入，包括会员分摊金额、商机相关产品消耗金额、广告消耗金额、增值服务、园区租金、技术服务费、扣除的保证金",
  incomeshop: "统计周期内，收入>0的服务商数（服务商收入来源包含服务商赏金、推广员分成、退税给服务商和退还快递费）",
  zworkshop: "有猪八戒网账号的入驻企业数，统计历史累计至时间选择中结束时间的数据；",
  zworkpart: "八戒工场数据，均统计历史累计数据，截止时间为时间选择中的结束时间；</br>"
  + "社区数:社区的数量（已运营+待运营）</br>"
  + "分布城市数:社区布局的城市数量</br>" 
  + "运营面积:各社区签约面积之和</br>" 
  + "工位数:可对外出售的工位的数量</br>" 
  + "入驻企业数:入驻社区的企业及个体数量</br>" 
  + "入驻人数:入驻企业的员工数量之和</br>" 
  + "社区收入:社区通过工位、办公室、会议室、场地的营收收入，根据权责发生制按实际发生月份分摊</br>" 
  + "工位出租率:当月出租工位工天/所有工位总共天</br>",

}