export const Column = [{
  key: "NONE",
  title: "排名",
  dataIndex: "NONE",
  render: (text, record, index) => index + 1
}, {
  key: "product",
  title: "产品",
  dataIndex: "product",
}, {
  key: "contract",
  title: "签约量",
  dataIndex: "contract",
  defaultSortOrder: 'descend',
  sorter: (a, b) => a.contract - b.contract,
}, {
  key: "contractMoney",
  title: "签约金额",
  dataIndex: "contractMoney",
  sorter: (a, b) => a.contractMoney - b.contractMoney,
  render: (text, record, index) => text + 'w'
}, {
  key: "pay",
  title: "交付量",
  dataIndex: "pay",
  sorter: (a, b) => a.pay - b.pay,
}, {
  key: "payMoney",
  title: "交付金额",
  dataIndex: "payMoney",
  sorter: (a, b) => a.payMoney - b.payMoney,
  render: (text, record, index) => text + 'w'
}];
export const FunelConfig = {
  submit: "提交量",
  contract: "签约量",
  contractMoney: "签约金额",
  contractRate: "签约率：",
  pay: "交付量",
  payMoney: "交付金额",
  payRate: "交付率："
}
export const IntroText = {
  overview: "1、UV：即全站独立访客数，详细说明请见页面底部；</br>2、提交量：以订单提交时间统计，提交的订单量，详细说明请见页面底部；</br>3、签约量&签约金额： 以雇主选标时间计算，雇主选标的订单量&订单金额，详细说明请见页面底部；</br>4、交付量&交付金额： 以订单结项时间计算，已结项且未全额退款的订单&订单金额，详细说明请见页面底部；</br>5、签约率 = 签约量 / 提交量；</br>6、交付率 = 交付量 / 提交量；</br>",
  assign: "分配量： 按照分配时间计算，分配至各个顾问的订单量，一个订单可能流转至多个交易顾问。其中，区域属性及产品属性按照交易顾问所属组织架构划分，员工离职对应组织架构调整可能会导致数据不同时期查询结果略有差异",
  assignSituation: "派单量： 按照派单时间统计，派给服务商的订单量。其中，区域属性依据派给的服务商的地区属性划分，产品属性依据派给的服务商的主营类目进行映射划分。</br>另，服务商会员属性：派单时间与服务商会员有效时间结合判断服务商会员属性，当服务商出现多个会员身份时，则按照工场会员、在线会员、普通会员的先后顺序计算，工场会员下钻属性则依据固定工位、专属办公室、漫游工位、定制办公室的先后顺序计算",
};
export const BottomIntroText = "（1）SEM渠道投放金额：运营中心SEM渠道投放每个月实际花费金额；</br>" +
    "（2）集团UV：统计周期内，集团PC、WAP、买家APP端整体的独立访客数；</br>" +
    "（3）店铺有效UV：店铺有效UV：指进入店铺的有效UV，其中直访到店铺的流量占比超过整体店铺直访UV有效占比时记直访UV的整体店铺直访UV有效占比为有效，非直访UV均为有效流量（其中广告流量不计算在内）</br>" +
    "（4）ZBJ卖场订单提交量：统计周期内，ZBJ卖场订单的提交量（不含官方自营店铺和分包订单）；</br>" +
    "（5）ZBJ卖场订单成交量：统计周期内，ZBJ卖场订单的成交量（不含官方自营店铺和分包订单）；</br>" +
    "（6）ZBJ卖场订单成交金额：统计周期内，ZBJ卖场订单的成交金额（不含官方自营店铺和分包订单）；</br>" +
    "（7）1V1订单提交量：统计周期内，ZBJ卖场订单中，雇佣模式的提交量（不含官方自营店铺和分包订单）；</br>" +
    "（8）1V1订单成交量：统计周期内，ZBJ卖场订单中,1V1(雇佣)模式的成交量（不含官方自营店铺和分包订单）；</br>" +
    "（9）1V1订单成交金额：统计周期内，ZBJ卖场订单中,1V1(雇佣)模式的成交金额（不含官方自营店铺和分包订单）；</br>" +
    "（10）1V1订单技术服务费：统计周期内，ZBJ卖场订单中,1V1(雇佣)模式的订单收取的技术服务费（不含官方自营店铺和分包订单）；</br>" +
    "（11）店铺咨询量：统计周期内，咨询服务商的人数（咨询方式包括IM、隐私小号、真实号码、QQ点击服务商店铺按钮）。其中，IM咨询必须建立含雇主和服务商的会话，不包含官方系统消息；隐私小号需要拨打接通；真实号码和QQ号码统计的都是在店铺点击咨询的人；</br>" +
    "（12）招标提交量：统计周期内，ZBJ卖场订单中,招标模式的提交量（不含官方自营店铺和分包订单）；</br>" +
    "（13）中标量：统计周期内，招标模式，服务商角度中标的订单量（不含官方自营店铺和分包订单）；</br>" +
    "（14）招标订单成交量：统计周期内，ZBJ卖场订单中,招标模式的成交量（不含官方自营店铺和分包订单）；</br>" +
    "（15）招标订单成交金额：统计周期内，ZBJ卖场订单中,招标模式的成交金额（不含官方自营店铺和分包订单）；</br>" +
    "（16）招标订单技术服务费：统计周期内，ZBJ卖场订单中,招标模式的订单收取的技术服务费（不含官方自营店铺和分包订单）；"
