export const Column = [{
  key: "NONE",
  title: "排名",
  dataIndex: "NONE",
  render: (text, record, index) => index + 1
}, {
  key: "product",
  title: "产品",
  dataIndex: "product",
}, {
  key: "contract",
  title: "签约量",
  dataIndex: "contract",
  defaultSortOrder: 'descend',
  sorter: (a, b) => a.contract - b.contract,
}, {
  key: "contractMoney",
  title: "签约金额",
  dataIndex: "contractMoney",
  sorter: (a, b) => a.contractMoney - b.contractMoney,
  render: (text, record, index) => text + 'w'
}, {
  key: "pay",
  title: "交付量",
  dataIndex: "pay",
  sorter: (a, b) => a.pay - b.pay,
}, {
  key: "payMoney",
  title: "交付金额",
  dataIndex: "payMoney",
  sorter: (a, b) => a.payMoney - b.payMoney,
  render: (text, record, index) => text + 'w'
}];
export const FunelConfig = {
  submit: "提交量",
  contract: "签约量",
  contractMoney: "签约金额",
  contractRate: "签约率：",
  pay: "交付量",
  payMoney: "交付金额",
  payRate: "交付率："
}
export const IntroText = {
  overview: "1、UV：即全站独立访客数，详细说明请见页面底部；</br>2、提交量：以订单提交时间统计，提交的订单量，详细说明请见页面底部；</br>3、签约量&签约金额： 以雇主选标时间计算，雇主选标的订单量&订单金额，详细说明请见页面底部；</br>4、交付量&交付金额： 以订单结项时间计算，已结项且未全额退款的订单&订单金额，详细说明请见页面底部；</br>5、签约率 = 签约量 / 提交量；</br>6、交付率 = 交付量 / 提交量；</br>",
  assign: "分配量： 按照分配时间计算，分配至各个顾问的订单量，一个订单可能流转至多个交易顾问。其中，区域属性及产品属性按照交易顾问所属组织架构划分，员工离职对应组织架构调整可能会导致数据不同时期查询结果略有差异",
  assignSituation: "派单量： 按照派单时间统计，派给服务商的订单量。其中，区域属性依据派给的服务商的地区属性划分，产品属性依据派给的服务商的主营类目进行映射划分。</br>另，服务商会员属性：派单时间与服务商会员有效时间结合判断服务商会员属性，当服务商出现多个会员身份时，则按照工场会员、在线会员、普通会员的先后顺序计算，工场会员下钻属性则依据固定工位、专属办公室、漫游工位、定制办公室的先后顺序计算",
};
export const BottomIntroText = "1、核心小B数： 指今年（自然年）消费2w及以上的雇主数。</br>2、年均消费额：年均消费额=雇主总消费金额/核心小B数，雇主总消费金额包括：设计、IT、营销、综合、知产、财税、科技服务、企业管家、总分包订单打款金额，其中企业管家、总分包指分包订单结算金额。</br>3、UV：即全站独立访客数。平台UV包括猪八戒网\天蓬网\自营业务的独立访客之和（含APP）(对访客数量按天去重)，UV无法区分产品属性。</br>4、提交量： 以订单提交时间统计，提交的订单量。包含产品线、知产、财税、科技服务、区域总分包（含企业管家），其中知产财税科技服务为商机量。其次，区域属性依据订单地区属性划分，产品属性依据订单对应三级类目与各产品线的映射关系划分。</br>另，产品线剔除官方店铺作为雇主提交的订单、剔除分包订单；其中严选包含于自营及产品线订单中，合计时不做复计。</br>5、签约量&签约金额： 以雇主选标时间计算，雇主选标的订单量&订单金额。包含产品线、知产、财税、科技服务、区域总分包（含企业管家），其中知产财税科技服务、区域总分包为订单提交量。其次，区域属性依据订单地区属性划分，产品属性依据订单对应三级类目与各产品线的映射关系划分。</br>另，产品线剔除官方店铺作为雇主提交的订单、剔除分包订单；其中严选包含于自营及产品线订单中，合计时不做复计。</br>6、交付量&交付金额： 以订单结项时间计算，已结项且未全额退款的订单&订单金额。包含产品线、知产、财税、科技服务、区域总分包（含企业管家），其中知产财税科技服务为按照首次打款时间统计的订单成交量。其次，区域属性依据订单地区属性划分，产品属性依据订单对应三级类目与各产品线的映射关系划分。</br>另，产品线剔除官方店铺作为雇主提交的订单、剔除分包订单；其中严选包含于自营及产品线订单中，合计时不做复计。</br>7、签约率=签约量/提交量</br>8、交付率=交付量/提交量</br>9、分配量： 按照分配时间计算，分配至各个顾问的订单量，一个订单可能流转至多个交易顾问。其中，区域属性及产品属性按照交易顾问所属组织架构划分，员工离职对应组织架构调整可能会导致数据不同时期查询结果略有差异。</br>10、派单量： 按照派单时间统计，派给服务商的订单量。其中，区域属性依据派给的服务商的地区属性划分，产品属性依据派给的服务商的主营类目进行映射划分。</br>另，服务商会员属性：派单时间与服务商会员有效时间结合判断服务商会员属性，当服务商出现多个会员身份时，则按照工场会员、在线会员、普通会员的先后顺序计算，工场会员下钻属性则依据固定工位、专属办公室、漫游工位、定制办公室的先后顺序计算。"