export const BaseInfo = [{
  name: "提交雇主数",
  key: "submit",
  rateKey: "submitRate",
  extraText: "提交雇主数： 以订单提交时间统计，提交对应的雇主数： 各类型收入对应的主营业务成本；"
}, {
  name: "签约雇主数",
  key: "contract",
  rateKey: "contractRate",
  extraText: "签约雇主数： 以雇主选标时间计算，雇主选标的雇主数；详细说明请见页面底部。"
}, {
  name: "成交雇主数",
  key: "deal",
  rateKey: "dealRate",
  extraText: "成交雇主数： 按成交时间统计成交订单对应的用户数，以订单结束时间计算，已托管，状态为已完成，且未全额退款的订单对应的雇主数；详细说明请见页面底部。"
}, {
  name: "核心雇主数",
  key: "core",
  rateKey: "",
  extraText: "核心雇主数： 指今年（自然年）消费5000及以上的雇主数。详细说明请见页面底部。"
}, {
  name: "雇主消费留存率",
  key: "rate",
  rateKey: "",
  unit: "%",
  extraText: "雇主消费留存率： 雇主消费留存率 =上一年有消费的雇主在今年贡献的GSV / 上年年度雇主GSV；详细说明请见页面底部。"
}, {
  name: "雇主好评率",
  key: "greatRate",
  rateKey: "greatRateRate",
  unit: "%",
  extraText: "雇主好评率： 统计周期内，按评价时间，服务商对雇主的评价中好评比率。服务商主动好评率=服务商主动好评数量/服务商主动评价数量。注：雇主好评率无法区分产品，可区分区域。"
}];
export const SelectList = [{
  name: "提交雇主",
  value: "submit"
}, {
  name: "签约雇主",
  value: "sign"
}, {
  name: "成交雇主",
  value: "deal"
}, {
  name: "核心雇主",
  value: "key"
}];
export const RankTitle = ["排名", "雇主名", "交易额"];
export const IntroInfo = {
  topRank: "雇主交易额： 以订单的打款时间为准，统计时间段内雇主成功打款的金额。详细说明请见页面底部"
}
export const BottomIntroText = "1、核心小B数： 指今年（自然年）消费2w及以上的雇主数。</br>2、年均消费额：年均消费额=雇主总消费金额/核心小B数，雇主总消费金额包括：设计、IT、营销、综合、知产、财税、科技服务、企业管家、总分包订单打款金额，其中企业管家、总分包指分包订单结算金额。</br>3、提交雇主数： 以订单提交时间统计，提交对应的雇主数： 各类型收入对应的主营业务成本；</br>4、签约雇主数： 以雇主选标时间计算，雇主选标的雇主数；注：科技服务的签约雇主数无法区分到区域，所以选择某地区查看时，签约雇主数不包含科技服务的数据。</br>5、成交雇主数： 按成交时间统计成交订单对应的用户数，以订单结束时间计算，已托管，状态为已完成，且未全额退款的订单对应的雇主数；注：科技服务的成交雇主数无法区分到区域，所以选择某地区查看时，成交雇主数不包含科技服务的数据。</br>6、核心雇主数： 指今年（自然年）消费5000及以上的雇主数。注：科技服务的核心雇主数无法区分到区域，所以选择某地区查看时，核心雇主数不包含科技服务的数据。</br>7、雇主消费留存率： 雇主消费留存率 =上一年有消费的雇主在今年贡献的GSV / 上年年度雇主GSV；</br>注：</br>（1）科技服务的数据无法区分到区域，所以选择某地区查看时，雇主消费留存率不包含科技服务的数据。</br>（2）上述定义中的今年指当前时间往前推365天，如17年11月28日-18年11月28日，去年指当前时间往前推的倒数第二个365天，如16年11月28日-17年11月28日。</br>8、雇主好评率： 统计周期内，按评价时间，服务商对雇主的评价中好评比率。服务商主动好评率=服务商主动好评数量/服务商主动评价数量。注：雇主好评率无法区分产品，可区分区域。</br>9、雇主交易额： 以订单的打款时间为准，统计时间段内雇主成功打款的金额。注：科技服务的数据无法区分到区域，所以选择某地区查看时，雇主交易额不包含科技服务的数据。"