
// export const InvestInfo = [
//   { name: "招商率", value: 0, key:  "investAll"},
//   { name: "年化招商率", value: 0, key:"yearInvestAll" },
//   { name: "续签率", value: 0, key:"continueInvestAll" },
//   { name: "退租率", value: 0, key:"stopInvestAll" }
// ]

export const IntroInfo = {
  signCons: "签约客户数： 在截止最新时间状态，生效的有效合同中，企业id剔重后的数量。",
  communityCons: "社区总数： 除去测试社区外的其他所有社区的数量，需要根据社区状态和省份城市等选项，筛选需要的社区数及相关概览数据，其他数据相同。",
  signSituation: "工位总数： 社区除漫游工位以外的其他工位总数量（包括固定工位、专属办公室工位、定制办公室工位等）。详细说明请见页面底部。",
  newSign: "新签工位数： 在统计期间生效的有效合同中，签约的各类型工位的数量。</br>新签总金额： 在统计期间生效的有效合同的合同总金额减去线上会员折扣金额。 </br>新签客户数： 在统计期间生效的有效合同中，企业id剔重后的数量。",
  shop: "招商率：签约工位总数/可售工位数</br>年化招商率：开园社区的可售工位中，当年截止当天已出租天数总和/可售工位当年截止当天可出租天数总和。详细说明请见页面底部。</br>续签率：当年续签的合同工位总数/当年终止合同的工位数 。</br>退租率：（当年终止工位数-当年续签工位数）/（在租合同工位数+当年终止工位数）",
  receipt: "当期应收账款：当年/当月应收款的账款总金额（'账单状态'为[待支付or即将预期or已逾期or已支付or待退款or已退款]的账款)；</br>当期实收账款：当年/当月已收款的账款总金额（'账单状态'为[已支付or待退款or已退款]的账款)；</br>当期逾期账款：当年/当月产生的已逾期的账款总金额（'账单状态'为[已逾期]的账款)；详细说明请见页面底部"
}
export const BottomIntroText = "1、核心小B数： 指今年（自然年）消费2w及以上的雇主数。</br>2、年均消费额：年均消费额=雇主总消费金额/核心小B数，雇主总消费金额包括：设计、IT、营销、综合、知产、财税、科技服务、企业管家、总分包订单打款金额，其中企业管家、总分包指分包订单结算金额。</br>3、签约客户数： 在截止最新时间状态，生效的有效合同中，企业id剔重后的数量。</br>4、社区总数： 除去测试社区外的其他所有社区的数量，需要根据社区状态和省份城市等选项，筛选需要的社区数及相关概览数据，其他数据相同。</br>5、工位总数： 社区除漫游工位以外的其他工位总数量（包括固定工位、专属办公室工位、定制办公室工位等）。已签约工位数：可售工位中，状态为已租赁或已预约的工位总数；未签约工位数：可售工位中，状态为未租赁或未预约的工位数；内部占用工位数：内部企业在使用，不用于出租。已签约漫游工位数：状态为已租赁或已预约的漫游工位数;</br>6、新签工位数： 在统计期间生效的有效合同中，签约的各类型工位的数量。</br>7、新签总金额： 在统计期间生效的有效合同的合同总金额减去线上会员折扣金额。 </br>8、新签客户数： 在统计期间生效的有效合同中，企业id剔重后的数量。</br>9、招商率：签约工位总数/可售工位数</br>10、年化招商率：开园社区的可售工位中，当年截止当天已出租天数总和/可售工位当年截止当天可出租天数总和。工位可出租起始日期（以开园日期作为可出租起始日期）。只统计有效合同中的出租记录（有效合同是指'支付状态'为[部分支付or完全支付or已退款]，且'合同状态'为[已生效or到期退租or提前解约]）</br>11、续签率：当年续签的合同工位总数/当年终止合同的工位数 。</br>12、退租率：（当年终止工位数-当年续签工位数）/（在租合同工位数+当年终止工位数）</br>13、当期应收账款：当年/当月应收款的账款总金额（'账单状态'为[待支付or即将预期or已逾期or已支付or待退款or已退款]的账款)；以账单缴租日作为统计日期，统计当年/当月截止当天的应收款金额,仅统计有效合同（已生效、提前解约、到期退租的合同）的账款。</br>14、当期实收账款：当年/当月已收款的账款总金额（'账单状态'为[已支付or待退款or已退款]的账款)；以账单缴租日作为统计日期，统计当年/当月截止当天的实收款金额,仅统计有效合同（已生效、提前解约、到期退租的合同）的账款。</br>15、当期逾期账款：当年/当月产生的已逾期的账款总金额（'账单状态'为[已逾期]的账款)；以账单缴租日作为统计日期，统计当年/当月起租的账单已逾期的金额，仅统计有效合同账单。";