import React from 'react';
import Card from './Card';


const cards = (props) => {

    const cardItems = [
        {title: '服务商会员数', info: '服务商会员数：购买了服务商会员（888会员）且合同生效中的用户数量；X日售卖：指对应时间范围内新签约的服务商会员；'},
        {title: '服务商漫游会员数', info: '服务商漫游会员数：当前时间合同生效中的服务商漫游会员数，地域按购买的漫游会员地域统计，包含之前老版本漫游工位数据；' +
                'X日售卖：指对应时间范围内新签约的服务商漫游会员数量；'},
        {title: '漫游会员服务商数', info: '漫游会员服务商数：购买了服务商漫游会员，且合同生效中的服务商数量，地域按服务商注册地进行统计，一个服务商购买多个服务商漫游会员算1个，包含之前老版本漫游工位服务商数据；X日转化：指对应时间范围内，通过新签约服务商漫游会员，成为漫游会员服务商的服务商数量；' },
        {title: '服务商工场会员数', info: '服务商工场会员数：当前时间合同生效中的服务商工场会员数，地域按购买的服务商工场会员地域进行统计，包含之前商家版工位数据；X日售卖：指对应时间范围内新签约的服务商工场会员数量；'},
        {title: '服务商工场会员服务商数', info: '服务商工场会员服务商数：购买了服务商工场会员，且合同生效中的服务商数量，地域按服务商注册地进行统计，一个服务商购买多个服务商工场会员算1个，包含之前商家版工场会员服务商数据；' +
                'X日转化：指对应时间范围内，通过新签约服务商工场会员，成为服务商工场会员服务商的服务商数量；'},
        {title: '工场工位数', info: '工场工位数：当前时间合同生效中的的工场工位数，地域按购买地域进行统计，包含之前标准版工位数据；' +
                'X日售卖：指对应时间范围内新签约的工场工位数量；'},
        {title: '工场工位用户数', info: '工场会员用户数：购买了工场会员，且合同生效中的用户数量，地域按用户注册地进行统计，一个用户购买多个工场会员，算1个，包含之前标准版工场会员数据；' +
                'X日转化：指对应时间范围内，通过新签约工场工位，成为工场工位用户的用户数量；'},
    ];
    const midEnds = ['售卖', '售卖', '转化', '售卖', '转化', '售卖', '转化'];
    const bottomEnds = ['', '售卖', '转化', '售卖', '新增', '售卖', '转化'];



    return (
        <div className="income-tab" style={{display: "flex", height: 175}}>
            {cardItems.map((item, index) => (
                <Card item={{...item, ...props.data[index]}} midEnd={midEnds[index]} bottomEnd={bottomEnds[index]}/>
            ))}
        </div>
    )
};


export default cards;