import moment from 'moment';
export const firstChartItems = {
    header: '用户结构概览',
    topItems: ['店铺UV', '咨询量', '订单提交量', '订单成交量'],
    infos:
        {
            'SEM': '集团通过市场投放带来的流量',
            '直访': '直接访问猪八戒平台的用户带来的流量',
            '引荐': '引荐渠道带来的流量',
            '裂变': '服务商通过自己的运营动作，带来和产生的流量都作为裂变流量，包括服务商分享店铺、通过案例、圈子等方式的内容运营',
            'SEO': 'SEO渠道带来的非直接到店的流量'
        },

    data:[{"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "SEM", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "SEO", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "引荐", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "直访", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "裂变", "key7": ""}],
    isBottom: false
};


export const insideItems = {
    header: '站内流量分配及转化情况',
    topItems: ['店铺UV', '咨询量', '订单提交量', '订单成交量'],
    infos:
        {
            '列表刷新': '通过刷新产品分配的流量，即雇主点击搜索列表中非广告内容，进入服务商店铺后产生的店铺UV',
            '关键词推广': '通过关键词推广产品分配的流量，即雇主点击关键词广告进入服务商店铺后产生的店铺UV',
            '仙位推广': '通过仙位推广产品分配的流量，即雇主点击仙位广告进入服务商店铺后产生的店铺UV',
            '八戒快车': '通过八戒快车推广产品分配的流量，即雇主点击八戒快车广告进入服务商店铺后产生的店铺UV',
            '其他': '通过非广告、非刷新产品分配的流量，即雇主通过非搜索列表页以及站内其他广告产品进入店铺（例如通过交易大厅的招投标页面等方式）'
        },

    data:[{"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "仙位推广", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "八戒快车", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "关键词推广", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "其他", "key7": ""}, {"key1": "", "key2": "", "key5": "", "key6": "", "key3": "", "key4": "", "name": "列表刷新", "key7": ""}] ,
    isBottom: false
};


export const bottomItems = {
    header: '产品售卖情况',
    topItems: ['服务商数', '获得流量  服务商数', '店铺UV', '咨询量', '主站订单  提交量', '主站订单  成交量'],
};


export const URLS = {
    USER: 'manager/change/user',
    USER_LAYER: 'manager/change/userLayer',
    SERVICE_LAYER: 'manager/change/serviceLayer',
    SERVICE_INCOME_LAYER: 'manager/change/serviceIncomeLayer',
    SALE: 'manager/change/sale',
    SALE2: 'manager/change/sale2',
    SUBMIT_CHANCE: 'manager/change/create'
};

export const bottomIntroText = '（1）服务商会员数：购买了服务商会员（888会员）且合同生效中的用户数量；X日售卖：指对应时间范围内新签约的服务商会员；</br>' +
    '（2）服务商漫游会员数：当前时间合同生效中的服务商漫游会员数，地域按购买的漫游会员地域统计，包含之前老版本漫游工位数据；X日售卖：指对应时间范围内新签约的服务商漫游会员数量；</br>' +
    '（3）漫游会员服务商数：购买了服务商漫游会员，且合同生效中的服务商数量，地域按服务商注册地进行统计，一个服务商购买多个服务商漫游会员算1个，包含之前老版本漫游工位服务商数据；X日转化：指对应时间范围内，通过新签约服务商漫游会员，成为漫游会员服务商的服务商数量；</br>' +
    '（4）服务商工场会员数：当前时间合同生效中的服务商工场会员数，地域按购买的服务商工场会员地域进行统计，包含之前商家版工位数据；X日售卖：指对应时间范围内新签约的服务商工场会员数量；</br>' +
    '（5）服务商工场会员服务商数：购买了服务商工场会员，且合同生效中的服务商数量，地域按服务商注册地进行统计，一个服务商购买多个服务商工场会员算1个，包含之前商家版工场会员服务商数据；X日转化：指对应时间范围内，通过新签约服务商工场会员，成为服务商工场会员服务商的服务商数量；</br>' +
    '（6）工场工位数：当前时间合同生效中的的工场工位数，地域按购买地域进行统计，包含之前标准版工位数据；X日售卖：指对应时间范围内新签约的工场工位数量；</br>' +
    '（7）工场会员用户数：购买了工场会员，且合同生效中的用户数量，地域按用户注册地进行统计，一个用户购买多个工场会员，算1个，包含之前标准版工场会员数据；X日转化：指对应时间范围内，通过新签约工场工位，成为工场工位用户的用户数量；</br>' +
    '（8）注册用户数（累计）：历史记录中所有的注册用户数量</br>' +
    '（9）售卖数量与金额，指套餐或单品对应的成交订单的数量与成交金额，按成交时间计算';

export const DISABLED_START_TIME = moment('2019-09-01 00:00:00');